<h1 style="font-size: 2.0em;">Menata ulang penempatan kolom pada Data Frame</h1>

<h1 style="font-size: 1.6em;">Import Modules</h1>

In [5]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.2.2
1.26.4

<h1 style="font-size: 1.6em;">Persiapan Data Frame</h1>

In [7]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 10, size=(n_rows, n_cols)), 
                  columns=cols)
df

   A  B  C  D  E
0  1  4  6  6  3
1  7  3  4  7  1
2  7  9  4  8  8
3  2  7  1  4  5
4  1  3  1  1  6

<h1 style="font-size: 1.6em;">Menata ulang penempatan kolom pada Data Frame</h1>

In [9]:
df[['D', 'C', 'A', 'E', 'B']]

   D  C  A  E  B
0  6  6  1  3  4
1  7  4  7  1  3
2  8  4  7  8  9
3  4  1  2  5  7
4  1  1  1  6  3

In [11]:
df

   A  B  C  D  E
0  1  4  6  6  3
1  7  3  4  7  1
2  7  9  4  8  8
3  2  7  1  4  5
4  1  3  1  1  6

In [13]:
df = df[['D', 'C', 'A', 'E', 'B']]
df

   D  C  A  E  B
0  6  6  1  3  4
1  7  4  7  1  3
2  8  4  7  8  9
3  4  1  2  5  7
4  1  1  1  6  3